app/views/teams/show.html.erb

SELECT "bussinesses".* FROM "bussinesses" WHERE "bussinesses"."team_id" = ?  [["team_id", 1]]
SELECT 1 AS one FROM "bussinesses" WHERE "bussinesses"."team_id" = ? LIMIT ?  [["team_id", 3], ["LIMIT", 1]]
---

<% if @team.bussinesses.any? %>

SELECT "bussinesses".* FROM "bussinesses" WHERE "bussinesses"."team_id" = ?  [["team_id", 3]]
---
      <ul>
        <% @team.bussinesses.each do |bussiness| %>

SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 4]]
SELECT 1 AS one FROM "users" WHERE "users"."team_id" = ? LIMIT ?  [["team_id", 4], ["LIMIT", 1]]
---

<% if @team.users.any? %>

SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 4]]
---
      <ul>
        <% @team.users.each do |user| %>