app/views/users/_form.html.erb

    <%= form.label :role %>
    <%= form.collection_select(:role_id, Role.all, :id, :name) %>
---
SELECT "roles".* FROM "roles"