app/controllers/bussinesses_controller.rb

  def export
    @bussiness = Bussiness.all
---
SELECT "bussinesses".* FROM "bussinesses"