app/controllers/bussinesses_controller.rb

SELECT "bussinesses".* FROM "bussinesses" ORDER BY "bussinesses"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    #lista de todos los elementos
    @bussinesses = Bussiness.all

INSERT INTO "bussinesses" ("name", "street", "zipcode", "neighborhood", "interested", "created_at", "updated_at", "facebook", "instagram", "chatbot", "system_price", "newsletter", "trans_site", "delivery", "email", "comments") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #guardo en business parametros nuevos
    @bussiness = Bussiness.new(bussiness_params)

    respond_to do |format|
      if @bussiness.save

DELETE FROM "bussinesses" WHERE "bussinesses"."id" = ?  [["id", 6]]
---
  def destroy
    @bussiness.destroy

SELECT "bussinesses".* FROM "bussinesses" WHERE "bussinesses"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def set_bussiness
      @bussiness = Bussiness.find(params[:id])