app/controllers/roles_controller.rb

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "admin"], ["created_at", "2021-07-04 23:15:25.939019"], ["updated_at", "2021-07-04 23:15:25.939019"]]
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_role
      @role = Role.find(params[:id])