app/controllers/teams_controller.rb

SELECT MAX("teams"."id") FROM "teams"
---
  def new
    @team = Team.new
    #If there's a team then the next team will be --> team + 1
    @team.name = "Team-" + Team.maximum(:id).next.to_s

INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Team-2"], ["created_at", "2021-07-17 18:07:41.374329"], ["updated_at", "2021-07-17 18:07:41.374329"]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
    #binding pry

      if @team.save