app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "first_name", "last_name", "phone", "role_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "first_name" = ?, "last_name" = ?, "phone" = ? WHERE "users"."id" = ?  [["updated_at", "2021-06-22 19:53:35.248633"], ["first_name", "Alfonso"], ["last_name", "Cabello"], ["phone", "3333333"], ["id", 1]]