app/models/bussiness.rb

	 def set_status
	 	#establecer status en BD
	 	self.status = "created"
	 	self.save #para que se guarde
---
INSERT INTO "bussinesses" ("name", "street", "zipcode", "neighborhood", "interested", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "bussinesses" SET "updated_at" = ?, "status" = ? WHERE "bussinesses"."id" = ?  [["updated_at", "2021-07-23 03:42:37.683632"], ["status", "created"], ["id", 23]]

	def self.import(file)
		CSV.foreach(file.path, headers: false) do |row|
			Bussiness.find_or_create_by name: row[0],
			 street: row[1], zipcode: row[2],
			 neighborhood: row[3],
			 interested: row[4]
---
INSERT INTO "bussinesses" ("name", "street", "zipcode", "neighborhood", "interested", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "bussinesses".* FROM "bussinesses" WHERE "bussinesses"."name" = ? AND "bussinesses"."street" = ? AND "bussinesses"."zipcode" = ? AND "bussinesses"."neighborhood" = ? AND "bussinesses"."interested" = ? LIMIT ?  [["name", "wwwwwww"], ["street", "1111111111"], ["zipcode", "111111111"], ["neighborhood", "11111111"], ["interested", 0], ["LIMIT", 1]]